//
//  GojuonSeed.swift
//  soreseikai
//
//  Created by 伊藤愛結 on 2021/02/26.
//

import Foundation
import RealmSwift

struct GojuonSeed: GojuonProtocol {
    static var values: [[Any]] {
        return GojuonData.data
    }
}

struct GojuonData {
    static let data: [[Any]] = [
        [1,"あ"],
        [2,"い"],
        [3,"う"],
        [4,"え"],
        [5,"お"],
        [6,"か"],
        [7,"き"],
        [8,"く"],
        [9,"け"],
        [10,"こ"],
        [11,"さ"],
        [12,"し"],
        [13,"す"],
        [14,"せ"],
        [15,"そ"],
        [16,"た"],
        [17,"ち"],
        [18,"つ"],
        [19,"て"],
        [20,"と"],
        [21,"な"],
        [22,"に"],
        [23,"ぬ"],
        [24,"ね"],
        [25,"の"],
        [26,"は"],
        [27,"ひ"],
        [28,"ふ"],
        [29,"へ"],
        [30,"ほ"],
        [31,"ま"],
        [32,"み"],
        [33,"む"],
        [34,"め"],
        [35,"も"],
        [36,"や"],
        [37,"ゆ"],
        [38,"よ"],
        [39,"ら"],
        [40,"り"],
        [41,"る"],
        [42,"れ"],
        [43,"ろ"],
        [44,"わ"],
        [45,"が"],
        [46,"ぎ"],
        [47,"ぐ"],
        [48,"げ"],
        [49,"ご"],
        [50,"ざ"],
        [51,"じ"],
        [52,"ず"],
        [53,"ぜ"],
        [54,"ぞ"],
        [55,"ぱ"],
        [56,"ぴ"],
        [57,"ぷ"],
        [58,"ぺ"],
        [59,"ぽ"]
    ]
}
