//
//  OdaiSeed.swift
//  soreseikai
//
//  Created by 伊藤愛結 on 2021/02/26.
//

import Foundation
import RealmSwift

struct OdaiSeed: OdaiProtocol {
    static var values: [[Any]] {
        return OdaiData.data
    }
}

struct OdaiData {
    static let data: [[Any]] = [
        [1,"さらりと言えたらかっこいい言葉"],
        [2,"彼氏に言われてキュンとくる一言"],
        [3,"母親がよく言う一言"],
        [4,"日本の名曲"],
        [5,"中華料理の定番メニュー"],
        [6,"テンションの上がる出来事"],
        [7,"人にあげて喜ばれるもの"],
        [8,"プロスポーツ選手に必要なもの"],
        [9,"メガネが似合う有名人"],
        [10,"夏休みの定番行事"],
        [11,"滅多に食べられないご馳走"],
        [12,"お父さんが娘に嫌われること"],
        [13,"家にないと困るもの"],
        [14,"頭を使うもの"],
        [15,"悲しい出来事"],
        [16,"見るべきもの"],
        [17,"難しいもの"],
        [18,"子供の頃から学ぶべきもの"],
        [19,"懐かしいもの"],
        [20,"覚えているとかっこいいもの"]
    ]
}



